Cauchy/Cylinder/fine/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.00394;

boundaryField
{
    PipeWalls
    {
        type            kqRWallFunction;
        value           uniform 0.0000394;
    }
    Inlet
	{
        type            fixedValue;
        value           uniform 0.00394;
    }
	
    Outlet
    {
        type            zeroGradient;
    }

    Thermowell
    {
        type            kqRWallFunction;
        value           uniform 0.00394;
    }

}


// ************************************************************************* //
