Cauchy/Cylinder/fine/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.129;

boundaryField
{
    PipeWalls
    {
		type            omegaWallFunction;
        value           uniform 0.129;
    }
    Inlet
    {
        type            fixedValue;
        value           uniform 0.129;
    }
    Outlet
    {
        type            zeroGradient;

    }

    Thermowell
    {
        type            omegaWallFunction;
        value           uniform 0.129;
    }

}


// ************************************************************************* //