Cauchy/Cylinder/fine/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    PipeWalls
    {
        type            zeroGradient;
    }

    Inlet
    {
        type            zeroGradient;
    }

    Outlet
    {
        type            fixedValue;
		value			uniform 0;
    }

    Thermowell
    {
        type            zeroGradient;
    }


}

// ************************************************************************* //
